URLShortener2/app/models/shortened_url.rb

INSERT INTO "shortened_urls" ("submitter_id", "short_url", "long_url", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["submitter_id", 1], ["short_url", "X0yFe-OpIeM"], ["long_url", "Google.com"], ["created_at", "2021-02-01 20:49:10.643427"], ["updated_at", "2021-02-01 20:49:10.643427"]]
---
    def self.factory_create(user, long_url)
        ShortenedUrl.create!(
            :submitter_id => user.id,
            :long_url = long_url,
            :short_url => ShortenedUrl.random_code)

SELECT  1 AS one FROM "shortened_urls" WHERE "shortened_urls"."short_url" = $1 LIMIT $2  [["short_url", "X0yFe-OpIeM"], ["LIMIT", 1]]
---
    def self.random_code
        loop do
        code = SecureRandom::urlsafe_base64(16)
        return code unless shortened_urls.exists?(short_url: code)