URLShortener2/app/models/user.rb

    def self.factory_create(email)
        begin
        User.create!(email: email)
---
INSERT INTO "users" ("email", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["email", "Lane@gmail.com"], ["created_at", "2021-02-01 21:11:04.510026"], ["updated_at", "2021-02-01 21:11:04.510026"]]