URLShortener2/app/models/visit.rb

   def self.record_visit!(user, shortened_url)

        Visit.create!(
            visitor_id: user.id,
            url_id: shortened_url.id
        )
---
INSERT INTO "visits" ("visitor_id", "url_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["visitor_id", 1], ["url_id", 6], ["created_at", "2021-02-01 20:49:28.168918"], ["updated_at", "2021-02-01 20:49:28.168918"]]